class Robot(object):
    def __init__(self, tehnologie, docs, inginier):
        self.tehnologie = tehnologie
        self.docs = docs
        self.inginier = inginier
        self.finanses = finanses
        self.accounts = accounts
# Робот
#   тело
#     голова
#       глаза
#       челюсть
#       шея
#     руки
#       левая рука
#         ключица
#         плечё
#         локоть
#         запястье
#         кисть
#            пальцы
#            ладонь
#       правая рука
#         ключица
#         плечё
#         локоть
#         запястье
#         кисть
#            пальцы
#            ладонь
#     позвоночник
#       верх
#       середина
#       низ
#     ноги
#       таз
#       левая нога
#         бедро
#         голень
#         стопа
#            стопа
#            пальцы
#       правая нога
#         бедро
#         голень
#         стопа
#            стопа
#            пальцы

##   Чвсти
#       скелет
#          кости
##         суставы
##         сухощилья
#       двигательная система
##         мышцы
#          жылы
#       плоть
#       кожа
#          покрытие
#          датчики
#
#
#   ПО
#      управление телом
#         система стабилизации
#            Mujoco
#            GYM
#      распознавание видео
#         3D
#         распознавание объектов
#         трассировка объектов
#         семантика
#      речь
#         распознавание
#         NLP
#         генерация
#      мимика
#
#
#   электроника
#      модули
#         функции
#            система
#            датчики положения
#            датчики тока и напряжения
#            маршрутизацтор
#            видео
#            звук
#            шим-ренератор
#            драйвер
#         разъёмы
#      шлейфы
#         провода
#         разъёмы
#      привода
#         моторы-редукторы
#         электромагнитный
#         электростатический
#         передачи
#      питание
#         БП
#         АКБ
#         зарядная станция
#         двигатель магнитный
#
#
#
#
#
#
#
#